"app.title" = "Mac Systeminfo";
"cpu.title" = "CPU";
"cpu.usage" = "Auslastung: %.1f%%";
"cpu.cores" = "Kernauslastung";

"ram.title" = "Speicher";
"ram.usage" = "%.1f%% Belegt";

"disk.title" = "Festplatte";
"disk.usage" = "%.1f%% Belegt";

"network.title" = "Netzwerk";

"info.title" = "Allgemeine Informationen";
"info.host" = "Computername";
"info.model" = "Modell";
"info.os" = "Betriebssystem";
"info.processor" = "Prozessor";
"info.ramTotal" = "Gesamtspeicher";
"info.diskTotal" = "Gesamtplatz";
"info.localIP" = "Lokale IP";
"info.publicIP" = "Öffentliche IP";
"info.temp" = "Temperaturstatus";

"button.settings" = "Einstellungen";
"button.quit" = "App beenden";
"button.save" = "Änderungen speichern";
"button.close" = "Schließen";
"button.help" = "Benutzerhandbuch";
"button.report" = "Bericht erstellen";
"button.contact" = "Kontaktieren Sie uns";
"button.showWindow" = "Fenstermodus";
"report.title" = "Systembericht";
"report.subtitle" = "Zusammenfassung der Hardware- und Softwaredetails";
"report.hardware" = "Hardwarespezifikationen";
"report.network" = "Netzwerkinformationen";
"report.status" = "Aktueller Status";
"report.copy" = "Bericht kopieren";
"report.print" = "Drucken";
"report.date" = "Berichtsdatum";

"settings.title" = "Einstellungen";
"settings.general" = "Allgemein";
"settings.advanced" = "Erweitert";

"settings.view.title" = "Darstellung";
"settings.view.showWindow" = "Als Fenster anzeigen";
"settings.view.showCores" = "Kernauslastung anzeigen";
"settings.view.showNetwork" = "Netzwerkkarten anzeigen";
"settings.view.showDisk" = "Festplattenkarten anzeigen";

"settings.monitor.title" = "Systemmonitor";
"settings.monitor.toggle" = "Überwachung starten/stoppen";
"settings.monitor.energyMode" = "Energiesparmodus";
"settings.monitor.refreshTime" = "Aktualisierungsrate: %.1f s";
"settings.monitor.reset" = "CPU- und Netzwerkverlauf zurücksetzen";

"settings.theme.title" = "Erscheinungsbild Theme";
"settings.theme.label" = "Theme";
"settings.theme.auto" = "System";
"settings.theme.light" = "Hell";
"settings.theme.dark" = "Dunkel";
"menu.startup.title" = "Start";
"menu.startup.enable" = "Beim Login starten";
"menu.startup.disable" = "Start beim Login deaktivieren";

"temp.normal" = "Normal 🌡";
"temp.warm" = "Warm";
"temp.hot" = "Heiß 🔥";
"temp.critical" = "Kritisch 🚨";
"temp.unknown" = "Unbekannt";
"ip.loading" = "Lädt...";
"ip.notFound" = "Nicht gefunden";
"unknown" = "Unbekannt";

"settings.language.title" = "Sprache";
"settings.language.system" = "Systemstandard";
"settings.language.restart" = "Bitte starten Sie die App neu, damit die Sprachänderungen wirksam werden.";

"help.title" = "Hilfe";
"help.subtitle" = "Systeminfo – Funktionen und Bedienungsanleitung";
"help.version" = "Systeminfo – Version 1.1  •  macOS 15+";
"help.developer" = "Entwickler: ModelPC";

"help.cpu.title" = "CPU-Auslastung";
"help.cpu.desc" = "Zeigt die Prozessor-Auslastung in Echtzeit und im Zeitverlauf an. Das CPU-Diagramm verfolgt die letzten 30 Messwerte. Bei über 80 % färbt es sich rot und blinkt als Warnung. Bei Mehrkernprozessoren aktivieren Sie die Auslastung pro Kern unter Einstellungen > Darstellung > 'Kernauslastung anzeigen'.";

"help.ram.title" = "Speicherauslastung (RAM)";
"help.ram.desc" = "Die Summe der aktiven, inaktiven und reservierten Seiten wird als belegter Speicher berechnet und in Prozent angezeigt. Der blaue Fortschrittsbalken zeigt den aktuellen Status an.";

"help.disk.title" = "Festplattenbelegung";
"help.disk.desc" = "Zeigt die Gesamtkapazität und den belegten Platz Ihrer Hauptfestplatte (/) in Prozent an. Sie können die Festplattenkarte unter Einstellungen > Darstellung > 'Festplattenkarten anzeigen' ausblenden.";

"help.network.title" = "Netzwerkauslastung";
"help.network.desc" = "Zeigt die gesamte Download- + Upload-Geschwindigkeit über alle Netzwerkschnittstellen in KB/s an. Das Diagramm visualisiert die letzten 30 Messwerte auf einer dynamischen Skala. Unter Einstellungen > Darstellung > 'Netzwerkkarten anzeigen' ausblenden.";

"help.temp.title" = "Temperaturstatus";
"help.temp.desc" = "Die thermische Stufe des Systems wird über die macOS ThermalState API gelesen: Normal 🌡, Warm, Heiß 🔥 und Kritisch 🚨. Genaue Gradwerte werden von Apple nicht für Apps von Drittanbietern freigegeben.";

"help.settings.title" = "Einstellungen & Anpassung";
"help.settings.desc" = "Öffnen Sie die Einstellungen über das Symbol in der Menüleiste. Verwenden Sie die Registerkarte Darstellung, um Karten ein- oder auszuschalten. Wählen Sie das Thema Hell / Dunkel / Auto in der Registerkarte Erweitert. Passen Sie die Aktualisierungsrate zwischen 0,5 und 5 Sekunden an. Der Energiesparmodus reduziert die Aktualisierungsfrequenz bei Inaktivität.";

"help.menubar.title" = "Menüleiste & Fenstermodus";
"help.menubar.desc" = "Die App wird standardmäßig in der Menüleiste ausgeführt. Aktivieren Sie das eigenständige Fenster über Einstellungen > Darstellung > 'Als Fenster anzeigen'. Die Beschriftung der Menüleiste zeigt den aktuellen CPU-Prozentsatz und ein Mini-Diagramm.";

"contact.title" = "Kontakt";
"contact.subtitle" = "Kontaktieren Sie den Entwickler oder folgen Sie in den sozialen Medien";
"contact.email.title" = "E-Mail senden";
"contact.email.address" = "info@modelpc.com";
"contact.email.address2" = "Entwickler (modelpc91@gmail.com)";
"contact.social" = "Soziale Medien";
"contact.social.youtube" = "YouTube";
"contact.social.github" = "GitHub";
"contact.social.x" = "X (Twitter)";
"contact.social.instagram" = "Instagram";
"contact.social.website" = "Webseite";
